# LayerElemCompoundElemFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LayerElemCompoundElemFamily Property
ParameterTypeId Class See Also
---
"Compound Element Family"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LayerElemCompoundElemFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LayerElemCompoundElemFamily As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LayerElemCompoundElemFamily {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace